In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

In [41]:
tit_df=pd.read_csv("titanic.csv")
tit_df=tit_df.dropna()
tit_df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
6,7,0,1,"McCarthy, Mr. Timothy J",male,54.0,0,0,17463,51.8625,E46,S
10,11,1,3,"Sandstrom, Miss. Marguerite Rut",female,4.0,1,1,PP 9549,16.7000,G6,S
11,12,1,1,"Bonnell, Miss. Elizabeth",female,58.0,0,0,113783,26.5500,C103,S

In [42]:
inp=tit_df[['Pclass','Sex','Age','Fare']]
inp.head()

    Pclass     Sex   Age     Fare
1        1  female  38.0  71.2833
3        1  female  35.0  53.1000
6        1    male  54.0  51.8625
10       3  female   4.0  16.7000
11       1  female  58.0  26.5500

In [43]:
dum=pd.get_dummies(inp['Sex'])
dum

     female  male
1         1     0
3         1     0
6         0     1
10        1     0
11        1     0
..      ...   ...
871       1     0
872       0     1
879       1     0
887       1     0
889       0     1

[183 rows x 2 columns]

In [44]:
inp_feature=pd.concat([dum,inp],axis='columns')
inp_feature=inp_feature.drop('Sex',axis='columns')

In [52]:
out_feature=tit_df['Survived']
out_feature

1      1
3      1
6      0
10     1
11     1
      ..
871    1
872    0
879    1
887    1
889    1
Name: Survived, Length: 183, dtype: int64

In [46]:
from sklearn import tree

In [47]:
tr_obj=tree.DecisionTreeClassifier()

In [48]:
from sklearn.model_selection import train_test_split

In [58]:
X_train, X_test, y_train, y_test =train_test_split(inp_feature,out_feature,train_size=0.2)

In [59]:
tr_obj.fit(X_train,y_train)

DecisionTreeClassifier()

In [62]:
tr_obj.predict(X_test)

array([1, 1, 0, 1, 1, 0, 1, 0, 0, 0, 1, 1, 1, 1, 1, 0, 1, 1, 1, 1, 1, 0,
       1, 0, 1, 1, 1, 0, 0, 1, 1, 1, 0, 0, 0, 0, 1, 1, 1, 1, 1, 1, 0, 1,
       1, 1, 0, 0, 0, 0, 1, 1, 0, 0, 0, 1, 0, 0, 0, 1, 1, 0, 1, 1, 0, 0,
       0, 0, 0, 0, 1, 0, 1, 1, 1, 1, 0, 0, 1, 1, 0, 0, 1, 1, 1, 1, 1, 1,
       0, 0, 0, 1, 1, 1, 0, 0, 0, 1, 1, 0, 1, 1, 1, 1, 1, 0, 1, 1, 1, 0,
       1, 1, 0, 0, 0, 1, 0, 1, 1, 0, 1, 1, 1, 1, 0, 1, 1, 1, 1, 1, 0, 1,
       1, 1, 1, 0, 1, 0, 1, 0, 0, 1, 1, 1, 1, 0, 0], dtype=int64)

In [63]:
tr_obj.score(X_test,y_test)

0.6462585034013606